package com.example.demo.enums;

import lombok.Getter;

/**
 * @Description
 * @Author toms
 * @Date 2019/7/2
 */
@Getter
public enum  ExeclEnums {


    /**
     * 持仓买
     */
    POSITION_BUY_TODAY("001","当日订货查询(采购)","客户,补充担保履约资金,客户名称,数量,均价",2,0),

    /**
     * 持仓卖
     */
    POSITION_SELL_TODAY("002","当日订货查询(销售)","客户,客户名称,数量,均价,补充担保履约资金",2,0),

    /**
     * 持仓明细
     */
    POSITION_DETAIL("003","当日订货查询(明细)","客户,客户名称,客户号,成交日期,购销计划,数量,价格,购/销,订立/转让,预计报价,结算日期",2,0),

    /**
     * 提前、到期采购汇总
     */
    DELIEVERY_B("004","提前、到期采购汇总","客户号,客户名称,购销计划,数量(手),数量(吨),购销总价,均价",2,0),

    /**
     *提前、到期销售汇总
     */
    DELIEVERY_S("005","提前、到期销售汇总","客户号,客户名称,购销计划,数量(手),数量(吨),购销总价,均价",2,0),


    /**
     * 提前、到期销售明细
     */
    DELIEVERY_SD("006","提前、到期销售明细","客户,客户名称,交货日期,购销计划,交货数量,交货吨数,成交价格,购销总价,交货方式",2,0),


    /**
     * 提前、到期采购明细
     * ,购销总价,交货吨数,交货方式
     */
    DELIEVERY_BD("007","提前、到期采购明细","客户,客户名称,交货日期,购销计划,交货数量,成交价格",2,2),


    /**
     * 资金   ,冻结资金,可用资金,可预支诚意金
     */

    BALANCE("008","当日资金查询","客户,客户名称,上日诚意金余额,基本担保履约资金订货,基本担保履约金交收,补充担保履约资金订货,可预支诚意金,补充担保履约资金提前,补充担保履约资金到期,可用资金,冻结资金",2,0),



    /**
     * 保证金冻结
     */
    FREEZE_M("009","保证金冻结","备注,编号,日期,客户,冻结金额,解冻金额,操作员,操作日期,审核人,审核日期,审核状态",2,0),



    /**
     * 保证金解冻
     */
    THAW_M("010","保证金解冻","备注,编号,日期,解冻编号,解冻金额,操作员,操作日期,审核人,审核日期,审核状态",2,0),



    /**
     * 到期持仓
     */
    EXPIRED_POSITION("011","到期约定单查询","客户,成交编号,购销计划,成交日期,成交量",2,0),


    /**
     * 冻结信息(采购)
     */
    FREEZE_POSITION_B("012","冻结信息(采购)","冻结日期,冻结流水,客户,购销计划,冻结量,可解冻量,制单人,制单日期,审核人,审核日期,状态,业务来源,系统来源,申请人,备注",2,0),

    /**
     * 解冻信息(采购)
     */
    THAW_POSITION_B("013","解冻信息(采购)","解冻流水,解冻数量,制单人,制单日期,制单时间,审核人,审核日期,审核时间,状态,申请人,备注",2,0),


    /**
     * 冻结信息(采购)
     */
    FREEZE_POSITION_S("014","冻结信息(销售)","冻结日期,冻结流水,客户,购销计划,冻结量,可解冻量,制单人,制单日期,审核人,审核日期,状态,业务来源,系统来源,申请人,备注",2,0),

    /**
     * 解冻信息(销售)
     */
    THAW_POSITION_S("015","解冻信息(销售)","解冻流水,解冻数量,制单人,制单日期,制单时间,审核人,审核日期,审核时间,状态,申请人,备注",2,0),


    /**
     * 解冻金额
     */
    THAW_FREEZE_MONEY("016","保证金冻结","客户,冻结金额,解冻金额,操作员,审核人,审核状态,日期,审核日期,备注",2,2),


    /**
     * 买方交收
     */
    BUY_DELEVER("017","buy","交货日期,交货时间,客户,客户号,购销计划,成交日期,成交价,交货量,保证金量,交收方式",0,0),




    /**
     * 持仓采购
     */
    POSTION_BUT("018","当日订货查询(采购)","客户,客户名称,数量,均价,补充担保履约资金,成交价,交货量,保证金量,交收方式",0,0),



    /**
     * 买方交收-全量 客户号,交收方式
     */
    BUY_DELEVER_ALL("019","buy","交货日期,交货时间,成交日期,客户,购销计划,成交价,交货量,保证金量,货物盈亏,交货保证金,盈亏量,买卖",0,0),


    /**
     * 交收汇总
     */
    DELEVER_ALL("020","可办理释放的商品交货信息(采购)","交货日期,交货时间,客户,购销计划,交货量,交收盈亏量,订货总价",2,0),


    /**
     * 月返明细
     */
    MONTH_RETURN("021","客户返还统计(明细表)","客户名称,总交易量,客户,软件服务费,当开当平量,非当开当平量",2,2),

    /**
     * 成交汇总采购
     */
    TRADE_ALL_B("022","历史成交查询(采购)","日期,客户,客户名称,采购数量(手),变更采购数量(手)",2,2),//,变今,非变今

    /**
     * 历史成交查询(销售)
     */
    TRADE_ALL_S("023","历史成交查询(销售)","日期,客户,客户名称,销售数量(手),变更销售数量(手)",2,2),//,变今,非变今


    /**
     * 成功明细
     */
    TRADE_Details("024","历史成交查询(明细)","成交日期,客户,客户名称,购销计划,成交量,购/销,变今,成交价格",2,2),//


    /**
     * 持仓买  当日订货查询(采购) //,补充担保履约资金
     */
    POSITION_BUY("025","当日订货查询(采购)","客户,客户名称,数量,均价,补充担保履约资金,客户区域",2,0),

    /**
     * 持仓卖  当日订货查询(销售)
     */
    POSITION_SELL("026","当日订货查询(销售)","客户,客户名称,数量,均价,补充担保履约资金,客户区域",2,0),

    ;

    private String type;

    private String sheetName;

    private String fileds;

    private Integer startLineTo;

    private Integer startLineFrom;


    ExeclEnums(String type,String sheetName,String  fileds,Integer startLineTo,Integer startLineFrom){
        this.type = type;
        this.sheetName = sheetName;
        this.fileds = fileds;
        this.startLineTo = startLineTo;
        this.startLineFrom = startLineFrom;

    }


    public static ExeclEnums getByType(String type){

        if (type == null) {
            return null;
        }
        for (ExeclEnums institution : values()) {
            if (type.equalsIgnoreCase(institution.getType())) {
                return institution;
            }
        }
        return null;
    }



}
